OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1786.h
extern __at(0x011B) volatile __CM4CON1bits_t CM4CON1bits;

#define _C4NCH0                 0x01
#define _C4NCH1                 0x02
#define _C4NCH2                 0x04
#define _C4PCH0                 0x08
#define _C4PCH1                 0x10
#define _C4PCH2                 0x20
#define _C4INTN                 0x40
#define _C4INTP                 0x80

//==============================================================================


//==============================================================================
//        APFCON2 Bits

extern __at(0x011C) __sfr APFCON2;

typedef struct
  {
  unsigned CCP3SEL              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __APFCON2bits_t;

extern __at(0x011C) volatile __APFCON2bits_t APFCON2bits;

#define _CCP3SEL                0x01

//==============================================================================


//==============================================================================
//        APFCON Bits

extern __at(0x011D) __sfr APFCON;

typedef struct
  {
  unsigned CCP2SEL              : 1;
  unsigned RXSEL                : 1;
  unsigned TXSEL                : 1;
  unsigned SDISEL               : 1;
  unsigned SCKSEL               : 1;
  unsigned SDOSEL               : 1;
  unsigned CCP1SEL              : 1;
  unsigned C2OUTSEL             : 1;
  } __APFCONbits_t;

extern __at(0x011D) volatile __APFCONbits_t APFCONbits;

#define _CCP2SEL                0x01
#define _RXSEL                  0x02
#define _TXSEL                  0x04
#define _SDISEL                 0x08
#define _SCKSEL                 0x10
#define _SDOSEL                 0x20
#define _CCP1SEL                0x40
#define _C2OUTSEL               0x80

//==============================================================================


//==============================================================================
//        APFCON0 Bits

extern __at(0x011D) __sfr APFCON0;

typedef struct
  {
  unsigned CCP2SEL              : 1;
  unsigned RXSEL                : 1;
  unsigned TXSEL                : 1;
  unsigned SDISEL               : 1;
  unsigned SCKSEL               : 1;
  unsigned SDOSEL               : 1;
  unsigned CCP1SEL              : 1;
  unsigned C2OUTSEL             : 1;
  } __APFCON0bits_t;

extern __at(0x011D) volatile __APFCON0bits_t APFCON0bits;

#define _APFCON0_CCP2SEL        0x01
#define _APFCON0_RXSEL          0x02
#define _APFCON0_TXSEL          0x04
#define _APFCON0_SDISEL         0x08
#define _APFCON0_SCKSEL         0x10
#define _APFCON0_SDOSEL         0x20
#define _APFCON0_CCP1SEL        0x40
#define _APFCON0_C2OUTSEL       0x80

//==============================================================================


//==============================================================================
//        APFCON1 Bits

extern __at(0x011D) __sfr APFCON1;

typedef struct
  {
  unsigned CCP2SEL              : 1;
  unsigned RXSEL                : 1;
  unsigned TXSEL                : 1;
  unsigned SDISEL               : 1;
  unsigned SCKSEL               : 1;
  unsigned SDOSEL               : 1;
  unsigned CCP1SEL              : 1;
  unsigned C2OUTSEL             : 1;
  } __APFCON1bits_t;

extern __at(0x011D) volatile __APFCON1bits_t APFCON1bits;

#define _APFCON1_CCP2SEL        0x01
#define _APFCON1_RXSEL          0x02
#define _APFCON1_TXSEL          0x04
#define _APFCON1_SDISEL         0x08
#define _APFCON1_SCKSEL         0x10
#define _APFCON1_SDOSEL         0x20
#define _APFCON1_CCP1SEL        0x40
#define _APFCON1_C2OUTSEL       0x80

//==============================================================================


//==============================================================================
//        CM3CON0 Bits

extern __at(0x011E) __sfr CM3CON0;

typedef struct
  {
  unsigned C3SYNC               : 1;
  unsigned C3HYS                : 1;
  unsigned C3SP                 : 1;
  unsigned C3ZLF                : 1;
  unsigned C3POL                : 1;
  unsigned C3OE                 : 1;
  unsigned C3OUT                : 1;
  unsigned C3ON                 : 1;
  } __CM3CON0bits_t;

extern __at(0x011E) volatile __CM3CON0bits_t CM3CON0bits;

#define _C3SYNC                 0x01
#define _C3HYS                  0x02
#define _C3SP                   0x04
#define _C3ZLF                  0x08
#define _C3POL                  0x10
#define _C3OE                   0x20
#define _C3OUT                  0x40
#define _C3ON                   0x80

//==============================================================================


//==============================================================================
//        CM3CON1 Bits

extern __at(0x011F) __sfr CM3CON1;

typedef union
  {
  struct
    {
    unsigned C3NCH0             : 1;
    unsigned C3NCH1             : 1;
    unsigned C3NCH2             : 1;
    unsigned C3PCH0             : 1;
    unsigned C3PCH1             : 1;
    unsigned C3PCH2             : 1;
    unsigned C3INTN             : 1;
    unsigned C3INTP             : 1;
    };

  struct
    {
    unsigned C3NCH              : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 3;
    unsigned C3PCH              : 3;
    unsigned                    : 2;
    };
  } __CM3CON1bits_t;

extern __at(0x011F) volatile __CM3CON1bits_t CM3CON1bits;

#define _C3NCH0                 0x01
#define _C3NCH1                 0x02
#define _C3NCH2                 0x04
#define _C3PCH0                 0x08
#define _C3PCH1                 0x10
#define _C3PCH2                 0x20
#define _C3INTN                 0x40
#define _C3INTP                 0x80

//==============================================================================


//==============================================================================
//        ANSELA Bits

extern __at(0x018C) __sfr ANSELA;

typedef struct
  {
  unsigned ANSA0                : 1;
  unsigned ANSA1                : 1;
  unsigned ANSA2                : 1;
  unsigned ANSA3                : 1;
  unsigned ANSA4                : 1;
  unsigned ANSA5                : 1;
  unsigned                      : 1;
  unsigned ANSA7                : 1;
  } __ANSELAbits_t;

