OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1786.h
#define _ODCONB0                0x01
#define _ODCONB1                0x02
#define _ODCONB2                0x04
#define _ODCONB3                0x08
#define _ODCONB4                0x10
#define _ODCONB5                0x20
#define _ODCONB6                0x40
#define _ODCONB7                0x80

//==============================================================================


//==============================================================================
//        ODCONC Bits

extern __at(0x028E) __sfr ODCONC;

typedef struct
  {
  unsigned ODCONC0              : 1;
  unsigned ODCONC1              : 1;
  unsigned ODCONC2              : 1;
  unsigned ODCONC3              : 1;
  unsigned ODCONC4              : 1;
  unsigned ODCONC5              : 1;
  unsigned ODCONC6              : 1;
  unsigned ODCONC7              : 1;
  } __ODCONCbits_t;

extern __at(0x028E) volatile __ODCONCbits_t ODCONCbits;

#define _ODCONC0                0x01
#define _ODCONC1                0x02
#define _ODCONC2                0x04
#define _ODCONC3                0x08
#define _ODCONC4                0x10
#define _ODCONC5                0x20
#define _ODCONC6                0x40
#define _ODCONC7                0x80

//==============================================================================

extern __at(0x0291) __sfr CCPR1;
extern __at(0x0291) __sfr CCPR1L;
extern __at(0x0292) __sfr CCPR1H;

//==============================================================================
//        CCP1CON Bits

extern __at(0x0293) __sfr CCP1CON;

typedef union
  {
  struct
    {
    unsigned CCP1M0             : 1;
    unsigned CCP1M1             : 1;
    unsigned CCP1M2             : 1;
    unsigned CCP1M3             : 1;
    unsigned DC1B0              : 1;
    unsigned DC1B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP1M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC1B               : 2;
    unsigned                    : 2;
    };
  } __CCP1CONbits_t;

extern __at(0x0293) volatile __CCP1CONbits_t CCP1CONbits;

#define _CCP1M0                 0x01
#define _CCP1M1                 0x02
#define _CCP1M2                 0x04
#define _CCP1M3                 0x08
#define _DC1B0                  0x10
#define _DC1B1                  0x20

//==============================================================================

extern __at(0x0298) __sfr CCPR2;
extern __at(0x0298) __sfr CCPR2L;
extern __at(0x0299) __sfr CCPR2H;

//==============================================================================
//        CCP2CON Bits

extern __at(0x029A) __sfr CCP2CON;

typedef union
  {
  struct
    {
    unsigned CCP2M0             : 1;
    unsigned CCP2M1             : 1;
    unsigned CCP2M2             : 1;
    unsigned CCP2M3             : 1;
    unsigned DC2B0              : 1;
    unsigned DC2B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP2M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC2B               : 2;
    unsigned                    : 2;
    };
  } __CCP2CONbits_t;

extern __at(0x029A) volatile __CCP2CONbits_t CCP2CONbits;

#define _CCP2M0                 0x01
#define _CCP2M1                 0x02
#define _CCP2M2                 0x04
#define _CCP2M3                 0x08
#define _DC2B0                  0x10
#define _DC2B1                  0x20

//==============================================================================


//==============================================================================
//        SLRCONA Bits

extern __at(0x030C) __sfr SLRCONA;

typedef struct
  {
  unsigned SLRCONA0             : 1;
  unsigned SLRCONA1             : 1;
  unsigned SLRCONA2             : 1;
  unsigned SLRCONA3             : 1;
  unsigned SLRCONA4             : 1;
  unsigned SLRCONA5             : 1;
  unsigned SLRCONA6             : 1;
  unsigned SLRCONA7             : 1;
  } __SLRCONAbits_t;

extern __at(0x030C) volatile __SLRCONAbits_t SLRCONAbits;

#define _SLRCONA0               0x01
#define _SLRCONA1               0x02
#define _SLRCONA2               0x04
#define _SLRCONA3               0x08
#define _SLRCONA4               0x10
#define _SLRCONA5               0x20
#define _SLRCONA6               0x40
#define _SLRCONA7               0x80

//==============================================================================


//==============================================================================
//        SLRCONB Bits

extern __at(0x030D) __sfr SLRCONB;

typedef struct
  {
  unsigned SLRCONB0             : 1;
  unsigned SLRCONB1             : 1;
  unsigned SLRCONB2             : 1;
  unsigned SLRCONB3             : 1;
  unsigned SLRCONB4             : 1;
  unsigned SLRCONB5             : 1;
  unsigned SLRCONB6             : 1;
  unsigned SLRCONB7             : 1;
  } __SLRCONBbits_t;

extern __at(0x030D) volatile __SLRCONBbits_t SLRCONBbits;

#define _SLRCONB0               0x01
#define _SLRCONB1               0x02
#define _SLRCONB2               0x04
#define _SLRCONB3               0x08
#define _SLRCONB4               0x10
#define _SLRCONB5               0x20
#define _SLRCONB6               0x40
#define _SLRCONB7               0x80

//==============================================================================


//==============================================================================
//        SLRCONC Bits

extern __at(0x030E) __sfr SLRCONC;

typedef struct
  {
  unsigned SLRCONC0             : 1;
  unsigned SLRCONC1             : 1;
  unsigned SLRCONC2             : 1;
  unsigned SLRCONC3             : 1;
  unsigned SLRCONC4             : 1;
  unsigned SLRCONC5             : 1;
  unsigned SLRCONC6             : 1;
  unsigned SLRCONC7             : 1;
  } __SLRCONCbits_t;

extern __at(0x030E) volatile __SLRCONCbits_t SLRCONCbits;

