OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1786.h
#define _PSMC1DC0               0x01
#define _PSMC1DC1               0x02
#define _PSMC1DC2               0x04
#define _PSMC1DC3               0x08
#define _PSMC1DC4               0x10
#define _PSMC1DC5               0x20
#define _PSMC1DC6               0x40
#define _PSMC1DC7               0x80

//==============================================================================


//==============================================================================
//        PSMC1DCH Bits

extern __at(0x0824) __sfr PSMC1DCH;

typedef struct
  {
  unsigned PSMC1DC8             : 1;
  unsigned PSMC1DC9             : 1;
  unsigned PSMC1DC10            : 1;
  unsigned PSMC1DC11            : 1;
  unsigned PSMC1DC12            : 1;
  unsigned PSMC1DC13            : 1;
  unsigned PSMC1DC14            : 1;
  unsigned PSMC1DC15            : 1;
  } __PSMC1DCHbits_t;

extern __at(0x0824) volatile __PSMC1DCHbits_t PSMC1DCHbits;

#define _PSMC1DC8               0x01
#define _PSMC1DC9               0x02
#define _PSMC1DC10              0x04
#define _PSMC1DC11              0x08
#define _PSMC1DC12              0x10
#define _PSMC1DC13              0x20
#define _PSMC1DC14              0x40
#define _PSMC1DC15              0x80

//==============================================================================

extern __at(0x0825) __sfr PSMC1PR;

//==============================================================================
//        PSMC1PRL Bits

extern __at(0x0825) __sfr PSMC1PRL;

typedef struct
  {
  unsigned PSMC1PR0             : 1;
  unsigned PSMC1PR1             : 1;
  unsigned PSMC1PR2             : 1;
  unsigned PSMC1PR3             : 1;
  unsigned PSMC1PR4             : 1;
  unsigned PSMC1PR5             : 1;
  unsigned PSMC1PR6             : 1;
  unsigned PSMC1PR7             : 1;
  } __PSMC1PRLbits_t;

extern __at(0x0825) volatile __PSMC1PRLbits_t PSMC1PRLbits;

#define _PSMC1PR0               0x01
#define _PSMC1PR1               0x02
#define _PSMC1PR2               0x04
#define _PSMC1PR3               0x08
#define _PSMC1PR4               0x10
#define _PSMC1PR5               0x20
#define _PSMC1PR6               0x40
#define _PSMC1PR7               0x80

//==============================================================================


//==============================================================================
//        PSMC1PRH Bits

extern __at(0x0826) __sfr PSMC1PRH;

typedef struct
  {
  unsigned PSMC1PR8             : 1;
  unsigned PSMC1PR9             : 1;
  unsigned PSMC1PR10            : 1;
  unsigned PSMC1PR11            : 1;
  unsigned PSMC1PR12            : 1;
  unsigned PSMC1PR13            : 1;
  unsigned PSMC1PR14            : 1;
  unsigned PSMC1PR15            : 1;
  } __PSMC1PRHbits_t;

extern __at(0x0826) volatile __PSMC1PRHbits_t PSMC1PRHbits;

#define _PSMC1PR8               0x01
#define _PSMC1PR9               0x02
#define _PSMC1PR10              0x04
#define _PSMC1PR11              0x08
#define _PSMC1PR12              0x10
#define _PSMC1PR13              0x20
#define _PSMC1PR14              0x40
#define _PSMC1PR15              0x80

//==============================================================================

extern __at(0x0827) __sfr PSMC1TMR;

//==============================================================================
//        PSMC1TMRL Bits

extern __at(0x0827) __sfr PSMC1TMRL;

typedef struct
  {
  unsigned PSMC1TMR0            : 1;
  unsigned PSMC1TMR1            : 1;
  unsigned PSMC1TMR2            : 1;
  unsigned PSMC1TMR3            : 1;
  unsigned PSMC1TMR4            : 1;
  unsigned PSMC1TMR5            : 1;
  unsigned PSMC1TMR6            : 1;
  unsigned PSMC1TMR7            : 1;
  } __PSMC1TMRLbits_t;

extern __at(0x0827) volatile __PSMC1TMRLbits_t PSMC1TMRLbits;

#define _PSMC1TMR0              0x01
#define _PSMC1TMR1              0x02
#define _PSMC1TMR2              0x04
#define _PSMC1TMR3              0x08
#define _PSMC1TMR4              0x10
#define _PSMC1TMR5              0x20
#define _PSMC1TMR6              0x40
#define _PSMC1TMR7              0x80

//==============================================================================


//==============================================================================
//        PSMC1TMRH Bits

extern __at(0x0828) __sfr PSMC1TMRH;

typedef struct
  {
  unsigned PSMC1TMR8            : 1;
  unsigned PSMC1TMR9            : 1;
  unsigned PSMC1TMR10           : 1;
  unsigned PSMC1TMR11           : 1;
  unsigned PSMC1TMR12           : 1;
  unsigned PSMC1TMR13           : 1;
  unsigned PSMC1TMR14           : 1;
  unsigned PSMC1TMR15           : 1;
  } __PSMC1TMRHbits_t;

extern __at(0x0828) volatile __PSMC1TMRHbits_t PSMC1TMRHbits;

#define _PSMC1TMR8              0x01
#define _PSMC1TMR9              0x02
#define _PSMC1TMR10             0x04
#define _PSMC1TMR11             0x08
#define _PSMC1TMR12             0x10
#define _PSMC1TMR13             0x20
#define _PSMC1TMR14             0x40
#define _PSMC1TMR15             0x80

//==============================================================================


//==============================================================================
//        PSMC1DBR Bits

extern __at(0x0829) __sfr PSMC1DBR;

typedef struct
  {
  unsigned PSMC1DBR0            : 1;
  unsigned PSMC1DBR1            : 1;
  unsigned PSMC1DBR2            : 1;
  unsigned PSMC1DBR3            : 1;
  unsigned PSMC1DBR4            : 1;
  unsigned PSMC1DBR5            : 1;
  unsigned PSMC1DBR6            : 1;
  unsigned PSMC1DBR7            : 1;
  } __PSMC1DBRbits_t;

extern __at(0x0829) volatile __PSMC1DBRbits_t PSMC1DBRbits;

#define _PSMC1DBR0              0x01
#define _PSMC1DBR1              0x02
#define _PSMC1DBR2              0x04
#define _PSMC1DBR3              0x08
#define _PSMC1DBR4              0x10
#define _PSMC1DBR5              0x20
#define _PSMC1DBR6              0x40
#define _PSMC1DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC1DBF Bits

extern __at(0x082A) __sfr PSMC1DBF;

typedef struct
  {
  unsigned PSMC1DBF0            : 1;
  unsigned PSMC1DBF1            : 1;
  unsigned PSMC1DBF2            : 1;
  unsigned PSMC1DBF3            : 1;
  unsigned PSMC1DBF4            : 1;
  unsigned PSMC1DBF5            : 1;
  unsigned PSMC1DBF6            : 1;
  unsigned PSMC1DBF7            : 1;
  } __PSMC1DBFbits_t;

