OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1786.h
extern __at(0x0834) __sfr PSMC2CLK;

typedef union
  {
  struct
    {
    unsigned P2CSRC0            : 1;
    unsigned P2CSRC1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2CPRE0            : 1;
    unsigned P2CPRE1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2CSRC             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P2CPRE             : 2;
    unsigned                    : 2;
    };
  } __PSMC2CLKbits_t;

extern __at(0x0834) volatile __PSMC2CLKbits_t PSMC2CLKbits;

#define _P2CSRC0                0x01
#define _P2CSRC1                0x02
#define _P2CPRE0                0x10
#define _P2CPRE1                0x20

//==============================================================================


//==============================================================================
//        PSMC2OEN Bits

extern __at(0x0835) __sfr PSMC2OEN;

typedef struct
  {
  unsigned P2OEA                : 1;
  unsigned P2OEB                : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC2OENbits_t;

extern __at(0x0835) volatile __PSMC2OENbits_t PSMC2OENbits;

#define _P2OEA                  0x01
#define _P2OEB                  0x02

//==============================================================================


//==============================================================================
//        PSMC2POL Bits

extern __at(0x0836) __sfr PSMC2POL;

typedef struct
  {
  unsigned P2POLA               : 1;
  unsigned P2POLB               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2INPOL              : 1;
  unsigned                      : 1;
  } __PSMC2POLbits_t;

extern __at(0x0836) volatile __PSMC2POLbits_t PSMC2POLbits;

#define _P2POLA                 0x01
#define _P2POLB                 0x02
#define _P2INPOL                0x40

//==============================================================================


//==============================================================================
//        PSMC2BLNK Bits

extern __at(0x0837) __sfr PSMC2BLNK;

typedef union
  {
  struct
    {
    unsigned P2REBM0            : 1;
    unsigned P2REBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned P2FEBM0            : 1;
    unsigned P2FEBM1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned P2REBM             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 4;
    unsigned P2FEBM             : 2;
    unsigned                    : 2;
    };
  } __PSMC2BLNKbits_t;

extern __at(0x0837) volatile __PSMC2BLNKbits_t PSMC2BLNKbits;

#define _P2REBM0                0x01
#define _P2REBM1                0x02
#define _P2FEBM0                0x10
#define _P2FEBM1                0x20

//==============================================================================


//==============================================================================
//        PSMC2REBS Bits

extern __at(0x0838) __sfr PSMC2REBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P2REBSC1             : 1;
  unsigned P2REBSC2             : 1;
  unsigned P2REBSC3             : 1;
  unsigned P2REBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2REBSIN             : 1;
  } __PSMC2REBSbits_t;

extern __at(0x0838) volatile __PSMC2REBSbits_t PSMC2REBSbits;

#define _P2REBSC1               0x02
#define _P2REBSC2               0x04
#define _P2REBSC3               0x08
#define _P2REBSC4               0x10
#define _P2REBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC2FEBS Bits

extern __at(0x0839) __sfr PSMC2FEBS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P2FEBSC1             : 1;
  unsigned P2FEBSC2             : 1;
  unsigned P2FEBSC3             : 1;
  unsigned P2FEBSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2FEBSIN             : 1;
  } __PSMC2FEBSbits_t;

extern __at(0x0839) volatile __PSMC2FEBSbits_t PSMC2FEBSbits;

#define _P2FEBSC1               0x02
#define _P2FEBSC2               0x04
#define _P2FEBSC3               0x08
#define _P2FEBSC4               0x10
#define _P2FEBSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC2PHS Bits

extern __at(0x083A) __sfr PSMC2PHS;

typedef struct
  {
  unsigned P2PHST               : 1;
  unsigned P2PHSC1              : 1;
  unsigned P2PHSC2              : 1;
  unsigned P2PHSC3              : 1;
  unsigned P2PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2PHSIN              : 1;
  } __PSMC2PHSbits_t;

extern __at(0x083A) volatile __PSMC2PHSbits_t PSMC2PHSbits;

#define _P2PHST                 0x01
#define _P2PHSC1                0x02
#define _P2PHSC2                0x04
#define _P2PHSC3                0x08
#define _P2PHSC4                0x10
#define _P2PHSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC2DCS Bits

extern __at(0x083B) __sfr PSMC2DCS;

typedef struct
  {
  unsigned P2DCST               : 1;
  unsigned P2DCSC1              : 1;
  unsigned P2DCSC2              : 1;
  unsigned P2DCSC3              : 1;
  unsigned P2DCSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P2DCSIN              : 1;
  } __PSMC2DCSbits_t;

