OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f1786.h
#define PSMC3DC0                PSMC3DCLbits.PSMC3DC0           // bit 0
#define PSMC3DC1                PSMC3DCLbits.PSMC3DC1           // bit 1
#define PSMC3DC2                PSMC3DCLbits.PSMC3DC2           // bit 2
#define PSMC3DC3                PSMC3DCLbits.PSMC3DC3           // bit 3
#define PSMC3DC4                PSMC3DCLbits.PSMC3DC4           // bit 4
#define PSMC3DC5                PSMC3DCLbits.PSMC3DC5           // bit 5
#define PSMC3DC6                PSMC3DCLbits.PSMC3DC6           // bit 6
#define PSMC3DC7                PSMC3DCLbits.PSMC3DC7           // bit 7

#define P3DCST                  PSMC3DCSbits.P3DCST             // bit 0
#define P3DCSC1                 PSMC3DCSbits.P3DCSC1            // bit 1
#define P3DCSC2                 PSMC3DCSbits.P3DCSC2            // bit 2
#define P3DCSC3                 PSMC3DCSbits.P3DCSC3            // bit 3
#define P3DCSC4                 PSMC3DCSbits.P3DCSC4            // bit 4
#define P3DCSIN                 PSMC3DCSbits.P3DCSIN            // bit 7

#define P3FEBSC1                PSMC3FEBSbits.P3FEBSC1          // bit 1
#define P3FEBSC2                PSMC3FEBSbits.P3FEBSC2          // bit 2
#define P3FEBSC3                PSMC3FEBSbits.P3FEBSC3          // bit 3
#define P3FEBSC4                PSMC3FEBSbits.P3FEBSC4          // bit 4
#define P3FEBSIN                PSMC3FEBSbits.P3FEBSIN          // bit 7

#define PSMC3FFA0               PSMC3FFAbits.PSMC3FFA0          // bit 0
#define PSMC3FFA1               PSMC3FFAbits.PSMC3FFA1          // bit 1
#define PSMC3FFA2               PSMC3FFAbits.PSMC3FFA2          // bit 2
#define PSMC3FFA3               PSMC3FFAbits.PSMC3FFA3          // bit 3

#define P3TPRIF                 PSMC3INTbits.P3TPRIF            // bit 0
#define P3TDCIF                 PSMC3INTbits.P3TDCIF            // bit 1
#define P3TPHIF                 PSMC3INTbits.P3TPHIF            // bit 2
#define P3TOVIF                 PSMC3INTbits.P3TOVIF            // bit 3
#define P3TPRIE                 PSMC3INTbits.P3TPRIE            // bit 4
#define P3TDCIE                 PSMC3INTbits.P3TDCIE            // bit 5
#define P3TPHIE                 PSMC3INTbits.P3TPHIE            // bit 6
#define P3TOVIE                 PSMC3INTbits.P3TOVIE            // bit 7

#define P3MSRC0                 PSMC3MDLbits.P3MSRC0            // bit 0
#define P3MSRC1                 PSMC3MDLbits.P3MSRC1            // bit 1
#define P3MSRC2                 PSMC3MDLbits.P3MSRC2            // bit 2
#define P3MSRC3                 PSMC3MDLbits.P3MSRC3            // bit 3
#define P3MDLBIT                PSMC3MDLbits.P3MDLBIT           // bit 5
#define P3MDLPOL                PSMC3MDLbits.P3MDLPOL           // bit 6
#define P3MDLEN                 PSMC3MDLbits.P3MDLEN            // bit 7

#define P3OEA                   PSMC3OENbits.P3OEA              // bit 0
#define P3OEB                   PSMC3OENbits.P3OEB              // bit 1

#define PSMC3PH8                PSMC3PHHbits.PSMC3PH8           // bit 0
#define PSMC3PH9                PSMC3PHHbits.PSMC3PH9           // bit 1
#define PSMC3PH10               PSMC3PHHbits.PSMC3PH10          // bit 2
#define PSMC3PH11               PSMC3PHHbits.PSMC3PH11          // bit 3
#define PSMC3PH12               PSMC3PHHbits.PSMC3PH12          // bit 4
#define PSMC3PH13               PSMC3PHHbits.PSMC3PH13          // bit 5
#define PSMC3PH14               PSMC3PHHbits.PSMC3PH14          // bit 6
#define PSMC3PH15               PSMC3PHHbits.PSMC3PH15          // bit 7

#define PSMC3PH0                PSMC3PHLbits.PSMC3PH0           // bit 0
#define PSMC3PH1                PSMC3PHLbits.PSMC3PH1           // bit 1
#define PSMC3PH2                PSMC3PHLbits.PSMC3PH2           // bit 2
#define PSMC3PH3                PSMC3PHLbits.PSMC3PH3           // bit 3
#define PSMC3PH4                PSMC3PHLbits.PSMC3PH4           // bit 4
#define PSMC3PH5                PSMC3PHLbits.PSMC3PH5           // bit 5
#define PSMC3PH6                PSMC3PHLbits.PSMC3PH6           // bit 6
#define PSMC3PH7                PSMC3PHLbits.PSMC3PH7           // bit 7

#define P3PHST                  PSMC3PHSbits.P3PHST             // bit 0
#define P3PHSC1                 PSMC3PHSbits.P3PHSC1            // bit 1
#define P3PHSC2                 PSMC3PHSbits.P3PHSC2            // bit 2
#define P3PHSC3                 PSMC3PHSbits.P3PHSC3            // bit 3
#define P3PHSC4                 PSMC3PHSbits.P3PHSC4            // bit 4
#define P3PHSIN                 PSMC3PHSbits.P3PHSIN            // bit 7

#define P3POLA                  PSMC3POLbits.P3POLA             // bit 0
#define P3POLB                  PSMC3POLbits.P3POLB             // bit 1
#define P3INPOL                 PSMC3POLbits.P3INPOL            // bit 6

#define PSMC3PR8                PSMC3PRHbits.PSMC3PR8           // bit 0
#define PSMC3PR9                PSMC3PRHbits.PSMC3PR9           // bit 1
#define PSMC3PR10               PSMC3PRHbits.PSMC3PR10          // bit 2
#define PSMC3PR11               PSMC3PRHbits.PSMC3PR11          // bit 3
#define PSMC3PR12               PSMC3PRHbits.PSMC3PR12          // bit 4
#define PSMC3PR13               PSMC3PRHbits.PSMC3PR13          // bit 5
#define PSMC3PR14               PSMC3PRHbits.PSMC3PR14          // bit 6
#define PSMC3PR15               PSMC3PRHbits.PSMC3PR15          // bit 7

#define PSMC3PR0                PSMC3PRLbits.PSMC3PR0           // bit 0
#define PSMC3PR1                PSMC3PRLbits.PSMC3PR1           // bit 1
#define PSMC3PR2                PSMC3PRLbits.PSMC3PR2           // bit 2
#define PSMC3PR3                PSMC3PRLbits.PSMC3PR3           // bit 3
#define PSMC3PR4                PSMC3PRLbits.PSMC3PR4           // bit 4
#define PSMC3PR5                PSMC3PRLbits.PSMC3PR5           // bit 5
#define PSMC3PR6                PSMC3PRLbits.PSMC3PR6           // bit 6
#define PSMC3PR7                PSMC3PRLbits.PSMC3PR7           // bit 7

#define P3PRST                  PSMC3PRSbits.P3PRST             // bit 0
#define P3PRSC1                 PSMC3PRSbits.P3PRSC1            // bit 1
#define P3PRSC2                 PSMC3PRSbits.P3PRSC2            // bit 2
#define P3PRSC3                 PSMC3PRSbits.P3PRSC3            // bit 3
#define P3PRSC4                 PSMC3PRSbits.P3PRSC4            // bit 4
#define P3PRSIN                 PSMC3PRSbits.P3PRSIN            // bit 7

#define P3REBSC1                PSMC3REBSbits.P3REBSC1          // bit 1
#define P3REBSC2                PSMC3REBSbits.P3REBSC2          // bit 2
#define P3REBSC3                PSMC3REBSbits.P3REBSC3          // bit 3
#define P3REBSC4                PSMC3REBSbits.P3REBSC4          // bit 4
#define P3REBSIN                PSMC3REBSbits.P3REBSIN          // bit 7

#define P3STRA                  PSMC3STR0bits.P3STRA            // bit 0
#define P3STRB                  PSMC3STR0bits.P3STRB            // bit 1

#define P3HSMEN                 PSMC3STR1bits.P3HSMEN           // bit 0
#define P3LSMEN                 PSMC3STR1bits.P3LSMEN           // bit 1
#define P3SSYNC                 PSMC3STR1bits.P3SSYNC           // bit 7

#define P3SYNC0                 PSMC3SYNCbits.P3SYNC0           // bit 0
#define P3SYNC1                 PSMC3SYNCbits.P3SYNC1           // bit 1
#define P3SYNC2                 PSMC3SYNCbits.P3SYNC2           // bit 2
#define P3DCPOL                 PSMC3SYNCbits.P3DCPOL           // bit 5
#define P3PRPOL                 PSMC3SYNCbits.P3PRPOL           // bit 6
#define P3POFST                 PSMC3SYNCbits.P3POFST           // bit 7

#define PSMC3TMR8               PSMC3TMRHbits.PSMC3TMR8         // bit 0
#define PSMC3TMR9               PSMC3TMRHbits.PSMC3TMR9         // bit 1
#define PSMC3TMR10              PSMC3TMRHbits.PSMC3TMR10        // bit 2
#define PSMC3TMR11              PSMC3TMRHbits.PSMC3TMR11        // bit 3
#define PSMC3TMR12              PSMC3TMRHbits.PSMC3TMR12        // bit 4
#define PSMC3TMR13              PSMC3TMRHbits.PSMC3TMR13        // bit 5
#define PSMC3TMR14              PSMC3TMRHbits.PSMC3TMR14        // bit 6
#define PSMC3TMR15              PSMC3TMRHbits.PSMC3TMR15        // bit 7

